# 1. Напишите программу, которая принимает на вход цифру, 
# обозначающую день недели, и проверяет, является ли этот день выходным.
# *Пример:*
# - 6 -> да
# - 7 -> да
# - 1 -> нет

# a = int(input('Введите день недели от 1 до 7: '))
# if a > 0 and a < 6:
#     print('это рабочий день')
# else:
#     print('Ошибка! необходимо ввести число от 1 до 7')
# if a > 5 and a < 8:
#     print('это выходной день')


# 2. Напишите программу для. проверки истинности утверждения ¬(X ⋁ Y ⋁ Z) = ¬X ⋀ ¬Y ⋀ ¬Z для всех значений предикат.

for x in range(2):
    for y in range(2):
        for z in range(2):
            a = not (x or y or z)
            b = not x and not y and not z
            result = a == b
    print("True")
else:
    print("False")

# 3. Напишите программу, которая принимает на вход координаты точки (X и Y), причём X ≠ 0 и Y ≠ 0 и выдаёт номер четверти плоскости, в которой находится эта точка (или на какой оси она находится).
# *Пример:*

# - x=34; y=-30 -> 4
# - x=2; y=4-> 1
# - x=-34; y=-30 -> 3